---
title: コマンド紹介 - execute

---

この章は一瞬で終わる.

## execute

`x` コマンドは, スタックから一つデータを pop する.  これが文字列データであるとする.  このとき, この文字列をそのまま dc のコマンドだと思って実行する.

```bash
> [100vp]
> f
100vp
# スタックには文字列データが一つ

> x
10
# `100vp` が実行された
# これは 10 という値を計算して, それを print するコマンド

> f
10
# `100vp` という計算結果の残骸が残っていることに注意
```

:::message
ところで `x` が pop したデータが文字列データではないとき, つまり数値データのとき, `x` は数値リテラルをコマンド入力したときと同じ動きをする. つまり, pop した値をただ push するということが行われる. 結果としてはスタックは何も変化しない.
:::

### read

一緒にこれも説明してしまおう.

一文字コマンド `?` は標準入力（つまりユーザーのキーボードからの入力）から一行を読んで, それを dc コマンドとして実行する. 次のように考えて良い.

1. 標準入力から一行, 文字列データを読んで push する
2. `x` する

例えば `"1 2 3"` という文字列は3つの数値データを順に push するという dc コマンドだ.

```bash
> ?
1 2 3  # 標準入力!

> f
3
2
1
```
